{
  "backend/main.mo": "Motoko canister implementing product management, user profiles, purchases, and admin‑gated actions with blob storage and role‑based access control.",
  "feature_evidence.json": "Feature evidence report mapping a frontend update‑request feature to its implementing files, components, and related tests.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Global Tailwind CSS setup defining OKLCH color variables, dark mode tokens, and base styling.",
  "frontend/index.html": "Basic HTML shell that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with theming and toast providers.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Displays an access‑denied message with an icon and button to return to the storefront.",
  "frontend/src/components/BrandHeader.tsx": "Header with logo, navigation links, login button, and conditional admin/user displays.",
  "frontend/src/components/Footer.tsx": "Footer with copyright, update‑request button opening a modal, and caffeine.ai attribution.",
  "frontend/src/components/Layout.tsx": "Page layout wrapper combining the header, main content, and footer.",
  "frontend/src/components/LoginButton.tsx": "Internet Identity login/logout button handling authentication state and query cache resets.",
  "frontend/src/components/ProductCard.tsx": "Card component showing product info, availability status, price, and link to product details.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal that collects a user's name and saves their profile using a mutation hook.",
  "frontend/src/components/RequestUpdateModal.tsx": "Modal for entering update instructions with clipboard copy and close handling.",
  "frontend/src/components/SearchAndFilterBar.tsx": "Search bar component that updates a query string via input changes.",
  "frontend/src/components/StorefrontHero.tsx": "Hero section displaying marketing text and a banner image for the storefront.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login, logout, and identity loading via a React context.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, roles, product listing, and admin product mutations.",
  "frontend/src/index.css": "Tailwind configuration defining light/dark theme variables, base typography, and layout utility classes.",
  "frontend/src/main.tsx": "App entry point initializing React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard for managing products, including creation, editing, deletion, publishing, and file uploads.",
  "frontend/src/pages/BuyerLibraryPage.tsx": "Displays the authenticated user's purchased products and allows downloading files with loading and error handling.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows detailed product information and enables authenticated users to purchase the item.",
  "frontend/src/pages/StorefrontPage.tsx": "Lists all storefront products with search filtering, loading states, and optional profile setup prompts.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, typography, animations, and plugins for the UI.",
  "project_state.json": "Defines the project’s metadata, existing features, requirements, and current state version."
}