{
  "backend/main.mo": "Motoko actor managing products, user profiles, purchases, admin‑gated product updates, and PDF uploads with access control.",
  "feature_evidence.json": "Feature evidence report listing implemented admin‑dashboard‑related features, involved files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend files, components, pages, hooks, and utilities.",
  "frontend/index.css": "Tailwind base styles defining light/dark OKLCH color tokens and global background/foreground rules.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "App router defining routes for storefront, product details, admin dashboard, and buyer library with theme and toaster providers.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Component showing an access‑denied message with optional details and a button back to the storefront.",
  "frontend/src/components/admin/AdminDiagnostics.tsx": "Admin diagnostics panel showing auth status, principal, admin checks, and product query state.",
  "frontend/src/components/admin/ProductFileUploadButton.tsx": "Button triggering PDF file selection and emitting the selected file for upload.",
  "frontend/src/components/BrandHeader.tsx": "Header with navigation, login handling, and admin‑state‑aware Admin button with loading, error, and unauthorized states.",
  "frontend/src/components/Footer.tsx": "Footer with copyright, developer tools modal trigger, and caffeine.ai attribution link.",
  "frontend/src/components/Layout.tsx": "Layout wrapping all pages with a persistent header, main content area, and footer.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button using Internet Identity, handling authentication state and error recovery.",
  "frontend/src/components/ProductCard.tsx": "Displays product details, type badge, price, and link to product detail page.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting user for their name and submitting profile setup via mutation.",
  "frontend/src/components/RequestUpdateModal.tsx": "Developer tool modal allowing update requests, retry command copying, and deployment failure report generation.",
  "frontend/src/components/SearchAndFilterBar.tsx": "Search bar component that updates the search query as the user types.",
  "frontend/src/components/StorefrontHero.tsx": "Hero section with marketing text and hero image for the storefront.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines react-query hooks for profiles, roles, admin checks, products, and product mutations using an actor backend.",
  "frontend/src/index.css": "Tailwind base, component, and utility layers with custom light/dark theme CSS variables and shared UI styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with InternetIdentityProvider and React Query client.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard handling product management, authentication checks, diagnostics, and dialogs for creating, editing, deleting, and uploading product files.",
  "frontend/src/pages/BuyerLibraryPage.tsx": "Displays purchased products and handles authenticated file downloads with error handling and UI feedback.",
  "frontend/src/pages/ProductDetailPage.tsx": "Loads and displays a single product’s details with purchase flow and error handling.",
  "frontend/src/pages/StorefrontPage.tsx": "Storefront listing page with search, filtering, profile prompts, and product loading states.",
  "frontend/src/utils/deploymentCommands.ts": "Provides helper functions returning recommended deployment retry and diagnostic commands.",
  "frontend/src/utils/deploymentFixSuggester.ts": "Maps parsed deployment errors to specific fix suggestions with optional command snippets.",
  "frontend/src/utils/deploymentLogParser.ts": "Parses raw deployment logs to extract the failing step and an error block.",
  "frontend/src/utils/formatDeploymentReport.ts": "Generates a formatted text report combining parsed deployment info and fix suggestions.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL and session-based parameters, supporting hash routing.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "JSON metadata describing project state, issues, and implemented features."
}