{
  "backend/main.mo": "Motoko backend actor handling product CRUD, publishing, file uploads, purchases, and user profiles with admin and user access control.",
  "feature_evidence.json": "Placeholder feature evidence report containing an empty features list.",
  "frontend-file-summaries.txt": "Pre-generated summaries describing all frontend component and utility files.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens and theme variables for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with ThemeProvider and Toaster.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Displays an access denied message with icon and a button to return to the storefront.",
  "frontend/src/components/admin/ProductFileUploadButton.tsx": "Button that triggers PDF file selection and passes the chosen file to a handler, with loading and disabled states.",
  "frontend/src/components/BrandHeader.tsx": "Header with branding, navigation, authentication state, and role‑aware links.",
  "frontend/src/components/Footer.tsx": "Footer showing copyright, developer tools button, and caffeine.ai attribution.",
  "frontend/src/components/Layout.tsx": "Page wrapper providing global header, footer, and main content area.",
  "frontend/src/components/LoginButton.tsx": "Handles Internet Identity login/logout with loading states and cache clearing.",
  "frontend/src/components/ProductCard.tsx": "Product preview card showing title, author, price, and link to details.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for first‑time users to submit their name and complete profile setup.",
  "frontend/src/components/RequestUpdateModal.tsx": "Modal with tabs for update requests, retry commands, and deployment failure report generation using log parsing and fix suggestions.",
  "frontend/src/components/SearchAndFilterBar.tsx": "Search bar component with an input field and icon for filtering by text.",
  "frontend/src/components/StorefrontHero.tsx": "Hero section displaying a headline, description, and hero image for the storefront.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to the user’s identity and refreshes related queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication, including login, logout, and identity restoration.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, roles, and products via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables and global utility classes.",
  "frontend/src/main.tsx": "App entry point configuring React Query and Internet Identity provider before rendering the root component.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin interface for creating, editing, deleting, publishing, and uploading files for products, with dialogs and upload progress handling.",
  "frontend/src/pages/BuyerLibraryPage.tsx": "Displays purchased products and lets authenticated users download product files with loading and error handling.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows product details, handles purchase flow, and displays loading or error states for a single product.",
  "frontend/src/pages/StorefrontPage.tsx": "Lists storefront products with search filtering, user profile checks, and loading/error displays.",
  "frontend/src/utils/deploymentCommands.ts": "Provides helper functions returning retry and diagnostic commands for deployments.",
  "frontend/src/utils/deploymentFixSuggester.ts": "Generates fix suggestions for deployment errors based on parsed log patterns.",
  "frontend/src/utils/deploymentLogParser.ts": "Parses deployment logs to identify failing steps and extract relevant error text.",
  "frontend/src/utils/formatDeploymentReport.ts": "Formats parsed deployment data and fix suggestions into a structured failure report string.",
  "frontend/src/utils/urlParams.ts": "Helpers to read URL or hash parameters, persist them in sessionStorage, and clear them from the hash.",
  "frontend/tailwind.config.js": "Tailwind config defining theme extensions, custom colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON describing the project's state, requirements, known issues, and existing feature versions."
}