{
  "backend/main.mo": "Main actor implementing a digital product store with blob storage, access control, categories, products, user profiles, and purchases. Includes auto-initialization logic that assigns the first authenticated user as admin and a persistent admin list for tracking admin status across upgrades.",
  "backend/migration.mo": "Migration module that preserves existing state (products, categories, userProfiles, purchases, systemInitialized, accessControlState) and adds a new adminPersistentState map to track admin users across canister upgrades.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: fixing admin authentication so users with the Admin menu option can access the dashboard, and fixing frontend admin access verification in useQueries hooks to properly handle backend isAdmin responses.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files including components, pages, hooks, and configuration. Key files include BrandHeader (conditionally shows Admin button only after isFetched is true and isAdmin is true), AdminDashboardPage (proper access control flow), useQueries (enhanced useIsCallerAdmin with isFetched tracking), and BuyerLibraryPage (purchased products with download functionality).",
  "frontend/index.css": "Global CSS with Tailwind directives defining OKLCH color system variables for light and dark modes, including background, foreground, card, primary, secondary, muted, accent, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point with cache-busting meta tags, viewport configuration, and root div for React mounting with module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for storefront, product detail, admin dashboard, buyer library, category browsing, about, and contact pages, wrapped in ThemeProvider and including Toaster for notifications.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-page access denied component displaying a shield alert icon, customizable message explaining automatic owner assignment, and a button to return to the storefront.",
  "frontend/src/components/admin/AdminDiagnostics.tsx": "Diagnostic display component showing authentication status, admin privileges, admin system initialization state, and products loading status with badges and icons.",
  "frontend/src/components/admin/AdminUploadsTroubleshootingHint.tsx": "Alert component that displays contextual troubleshooting messages for upload functionality based on authentication, admin status, and system initialization state with retry actions.",
  "frontend/src/components/admin/ProductFileUploadButton.tsx": "A React component that renders a file upload button for PDF files, using a hidden input with a label trigger for mobile compatibility. Validates file type, handles loading states, and provides callbacks for file selection and errors.",
  "frontend/src/components/admin/SafeProductUploadAction.tsx": "An error boundary class component that wraps ProductFileUploadButton to catch and display rendering errors. Shows an alert with error details if the upload button fails to render.",
  "frontend/src/components/BrandHeader.tsx": "Header component with desktop navigation and mobile Sheet menu that conditionally renders the Admin button only when authenticated, adminFetched is true, and isAdmin is explicitly true, preventing premature display during loading states or for non-admin users.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright, developer tools button, Caffeine.ai attribution with UTM tracking, build version info, and troubleshooting guidance for cache issues.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component that arranges BrandHeader, main content area, and Footer in a flex column structure.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component supporting desktop and mobile variants that handles Internet Identity login/logout with loading states and error recovery.",
  "frontend/src/components/ProductCard.tsx": "Product display card showing title, author, price, availability badge, and icon (book/notes), with a link to the product detail page.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users to enter their name for profile setup, with name normalization and non-dismissible behavior.",
  "frontend/src/components/RequestUpdateModal.tsx": "Developer tools modal with tabs for update requests, deployment retry commands, and deployment failure analysis with report generation and clipboard copy functionality.",
  "frontend/src/components/SearchAndFilterBar.tsx": "Search input component with icon for filtering products by title or author.",
  "frontend/src/components/StorefrontHero.tsx": "Hero section for the storefront with heading, description, and responsive hero image showcasing engineering resources.",
  "frontend/src/hooks/useActor.ts": "A React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity. Automatically invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for ICP integration, managing login/logout state, identity persistence, and delegation validation. Exports InternetIdentityProvider component and useInternetIdentity hook for accessing auth state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including admin system initialization, access control checks, user profile management, and category/product CRUD operations. Each hook properly handles actor availability and query invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light and dark modes using a technical, editorial color palette. Includes base styles for typography, layout utilities, and component classes.",
  "frontend/src/main.tsx": "Application entry point that sets up the React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/AboutPage.tsx": "A static informational page displaying Engineer Notes' mission, collection, community, and quality assurance using a card-based layout with icons. Includes prose content and feature highlights.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page for managing products with CRUD operations, file uploads, category management, and system initialization. Includes authentication checks, error handling, and UI for creating/editing/deleting products with progress tracking.",
  "frontend/src/pages/BuyerLibraryPage.tsx": "Library page displaying purchased products for authenticated users with download functionality. Filters products by purchase history and handles download errors with appropriate user feedback.",
  "frontend/src/pages/CategoryStorefrontPage.tsx": "Category-specific storefront page that displays products filtered by category with search functionality. Includes profile setup modal for authenticated users without profiles.",
  "frontend/src/pages/ContactPage.tsx": "Static contact page displaying various contact methods (general inquiries, technical support, content suggestions, business inquiries) organized in a card grid layout.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page showing individual product information with purchase functionality. Handles authentication, displays product metadata, and redirects to library after successful purchase.",
  "frontend/src/pages/StorefrontPage.tsx": "Main storefront page component that displays categories and products with search/filter functionality, handles user authentication, and shows a profile setup modal for new authenticated users.",
  "frontend/src/utils/adminErrors.ts": "Translates backend error messages into user-friendly text for admin UI, handling authorization, file upload, category, product, network, and purchase-related errors.",
  "frontend/src/utils/buildVersion.ts": "Manages build versioning for cache-busting by detecting version mismatches between stored and current versions, triggering a one-time hard reload when needed to prevent stale UI issues.",
  "frontend/src/utils/deploymentCommands.ts": "Provides helper functions that return recommended dfx deployment commands for retry, upgrade, and diagnostic operations on Internet Computer canisters.",
  "frontend/src/utils/deploymentFixSuggester.ts": "Analyzes parsed deployment logs and suggests fixes with rationale and code snippets for common deployment errors including build, bundle, and canister installation failures.",
  "frontend/src/utils/deploymentLogParser.ts": "Parses deployment output to identify the failing step (build, bundle, install, or unknown) and extracts relevant error text blocks using pattern matching.",
  "frontend/src/utils/formatDeploymentReport.ts": "Formats a structured deployment failure report for developers, combining parsed logs and fix suggestions into a readable text report with sections for failing step, suggested fix, commands, and error output.",
  "frontend/src/utils/normalizeProfileName.ts": "Provides a simple utility function to normalize user profile names by trimming leading and trailing whitespace for consistent handling.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support and parameter cleanup capabilities.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom theme extensions including OKLCH color system with CSS variables, container settings, custom animations for accordions, and includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state tracking file documenting a book library web app with Internet Identity authentication where admin functionality is visible but broken - users can see the admin menu option but cannot access admin features due to authentication/principal registration issues."
}