{
  "backend/main.mo": "Main Motoko actor implementing a digital product marketplace with blob storage, access control, categories, products, user profiles, purchases, and admin management including auto-initialization for the first authenticated user.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: admin price display/validation, admin price editing UI, and category listing product visibility fixes.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files including components, pages, hooks, and configuration, detailing the React app structure with authentication, product management, and storefront functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining light and dark theme variables for background, foreground, primary, secondary, muted, accent, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point with cache-busting meta tags, viewport configuration, and root div for React mounting with title 'Engineer Notes Shop'.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for storefront, product detail, admin dashboard, buyer library, category pages, about, and contact, wrapped in ThemeProvider and Toaster.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-page access denied component displaying shield icon, error message explaining auto-owner assignment, and button to return to storefront.",
  "frontend/src/components/admin/AdminDiagnostics.tsx": "Displays diagnostic information about authentication status, admin privileges, admin system initialization, and product loading states with status badges and refresh functionality.",
  "frontend/src/components/admin/AdminUploadsTroubleshootingHint.tsx": "Shows contextual alerts and troubleshooting hints for the admin upload feature based on authentication, admin status, and system initialization state with retry buttons.",
  "frontend/src/components/admin/ProductFileUploadButton.tsx": "A file upload button component for PDF files that uses a hidden input with label trigger for mobile compatibility, with validation and loading states.",
  "frontend/src/components/admin/SafeProductUploadAction.tsx": "Error boundary component that wraps ProductFileUploadButton to catch and display rendering errors with an alert UI instead of crashing.",
  "frontend/src/components/BrandHeader.tsx": "Responsive header with desktop navigation and mobile sheet menu, conditionally rendering admin button only after admin check completes and user is confirmed admin, plus category dropdown and authentication controls.",
  "frontend/src/components/Footer.tsx": "Footer component with copyright, developer tools modal trigger, caffeine.ai attribution with UTM tracking, and build version display with troubleshooting guidance for URL parameter forcing.",
  "frontend/src/components/Layout.tsx": "Root layout wrapper providing consistent page structure with BrandHeader, main content area, and Footer across all routes.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity authentication, displaying different states (logging in, authenticated, unauthenticated) with icons and supporting both default and mobile variants.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with title, author, price, type badge (Book/Notes), and a link to view product details.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts new users to enter their name to complete profile setup, with name normalization and form validation.",
  "frontend/src/components/RequestUpdateModal.tsx": "A multi-tab modal providing developer tools for requesting updates, retrying deployments, and analyzing deployment failures with copy-to-clipboard functionality and report generation.",
  "frontend/src/components/SearchAndFilterBar.tsx": "A search input component with an icon that allows filtering products by title or author.",
  "frontend/src/components/StorefrontHero.tsx": "A hero section component displaying a headline, description, and hero image for the engineering knowledge storefront.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance with authentication, initializing it with Internet Identity and admin token, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and delegation validation using @dfinity/auth-client.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including admin system initialization, access control checks, user profiles, categories, and product management with mutations and cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light/dark themes using a technical grayscale palette, plus utility classes for page layout, typography, and component styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AboutPage.tsx": "Static about page displaying Engineer Notes' mission, collection, community, and quality assurance information in a card-based layout with icons.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page for managing products with CRUD operations, file uploads, publishing controls, category management, and store initialization with authentication checks and error handling.",
  "frontend/src/pages/BuyerLibraryPage.tsx": "Displays a buyer's purchased products with download functionality, showing empty state if no purchases exist and handling authentication requirements.",
  "frontend/src/pages/CategoryStorefrontPage.tsx": "Shows products filtered by category with search functionality, includes query diagnostics panel for debugging, and handles profile setup modal for authenticated users.",
  "frontend/src/pages/ContactPage.tsx": "Static contact page displaying different contact methods (general inquiries, technical support, content suggestions, business inquiries) with email addresses and descriptions.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays detailed product information with purchase functionality, showing product metadata, pricing, and handling purchase flow with navigation to library after success.",
  "frontend/src/pages/StorefrontPage.tsx": "Main storefront page with hero section, category browsing grid, product search/filter, and query diagnostics panel for debugging product data.",
  "frontend/src/utils/adminErrors.ts": "Utility function that translates backend error messages into user-friendly text, handling authorization, file upload, network, and various admin operation errors.",
  "frontend/src/utils/buildVersion.ts": "Manages build version tracking and cache-busting by detecting version mismatches between stored and current versions, triggering a one-time hard reload when needed to prevent stale UI issues.",
  "frontend/src/utils/deploymentCommands.ts": "Provides helper functions that return recommended dfx deployment commands for retrying, upgrading, and diagnosing Internet Computer canister deployments.",
  "frontend/src/utils/deploymentFixSuggester.ts": "Analyzes parsed deployment logs and suggests specific fixes with rationale and code snippets based on common error patterns (build, bundle, install failures).",
  "frontend/src/utils/deploymentLogParser.ts": "Parses deployment output text to identify the failing step (build, bundle, install, or unknown) and extracts relevant error blocks using pattern matching.",
  "frontend/src/utils/formatDeploymentReport.ts": "Formats a structured deployment failure report for developers, combining parsed log data and fix suggestions into a readable text output with sections for failing step, suggested fix, commands, and error details.",
  "frontend/src/utils/normalizeProfileName.ts": "Provides a simple utility function to normalize user profile names by trimming whitespace for consistent handling across the application.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, container settings, typography, animations, and plugin integrations for the frontend styling.",
  "project_state.json": "Project state tracking file documenting an e-commerce platform with known issues around product visibility in category listings, existing features for admin dashboard price management, and pending feature requests to fix backend product queries and publish logic."
}