{
  "backend/main.mo": "Main actor implementing a digital product store with categories, products, user profiles, purchases, and access control. Includes auto-initialization logic that assigns the first non-anonymous caller as admin, plus manual initializeStore() function.",
  "backend/migration.mo": "Migration module that renames the adminSystemInitialized field to systemInitialized during canister upgrades.",
  "feature_evidence.json": "Feature evidence report documenting the need to remove or fix the 'Initialize as Owner' button since auto-initialization now handles owner assignment automatically.",
  "frontend-file-summaries.txt": "Pre-generated summaries of frontend files describing components, pages, hooks, and configuration for the digital storefront application with authentication and admin features.",
  "frontend/index.css": "Global CSS with Tailwind directives and custom OKLCH color variables for light and dark themes, including sidebar, chart, and semantic color tokens.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for storefront, product detail, admin, library, category, about, and contact pages, wrapped in ThemeProvider and Toaster.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-page access denied component displaying a shield icon and message explaining automatic owner assignment, with a button to return to storefront.",
  "frontend/src/components/admin/AdminDiagnostics.tsx": "Displays diagnostic information about authentication status, admin privileges, admin system initialization, and product loading states with status badges and icons.",
  "frontend/src/components/admin/AdminUploadsTroubleshootingHint.tsx": "Shows contextual alerts and troubleshooting hints for file upload functionality based on authentication, admin status, and system initialization state with retry buttons.",
  "frontend/src/components/admin/ProductFileUploadButton.tsx": "A file upload button component that accepts PDF files, validates file type, handles loading states, and uses a hidden input with label for mobile compatibility.",
  "frontend/src/components/admin/SafeProductUploadAction.tsx": "Error boundary component that wraps ProductFileUploadButton to catch and display rendering errors with a destructive alert UI.",
  "frontend/src/components/BrandHeader.tsx": "Header component with desktop navigation and mobile sheet menu that checks isCallerAdmin() to conditionally render admin access button with loading, error, and unauthorized states.",
  "frontend/src/components/Footer.tsx": "Footer component with copyright, developer tools modal trigger, caffeine.ai attribution link with UTM tracking, and build version display with troubleshooting guidance.",
  "frontend/src/components/Layout.tsx": "Root layout wrapper component that renders BrandHeader, main content area, and Footer in a flex column layout.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity authentication, displaying different states (logging in, authenticated, unauthenticated) with icons and supporting both default and mobile variants.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with title, author, price, type badge (Book/Notes), and a link to view product details.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts new users to enter their name for profile setup, with name normalization and form validation.",
  "frontend/src/components/RequestUpdateModal.tsx": "A multi-tab modal providing developer tools for requesting updates, retrying deployments, and analyzing deployment failures with copy-to-clipboard functionality and report generation.",
  "frontend/src/components/SearchAndFilterBar.tsx": "A search input component with a search icon that allows filtering products by title or author.",
  "frontend/src/components/StorefrontHero.tsx": "A hero section displaying a headline, description, and hero image for the engineering knowledge storefront.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor instance with authentication, initializing access control with admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including admin system initialization, access control checks, user profiles, categories, and product management with mutations and cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light/dark themes, typography styles, and utility classes for page layout and component styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AboutPage.tsx": "Static about page displaying Engineer Notes' mission, collection, community, and quality assurance information in a card-based layout.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page for managing products with CRUD operations, file uploads, publish/unpublish toggles, store initialization, and access control checks with comprehensive error handling and diagnostics.",
  "frontend/src/pages/BuyerLibraryPage.tsx": "Displays authenticated user's purchased products with download functionality, showing empty state with link to storefront if no purchases exist.",
  "frontend/src/pages/CategoryStorefrontPage.tsx": "Shows products filtered by category with search functionality, displays category icon/name and prompts profile setup for authenticated users without profiles.",
  "frontend/src/pages/ContactPage.tsx": "Static contact page displaying four contact cards (general inquiries, technical support, content suggestions, business inquiries) with example email addresses.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays detailed product information with purchase button that redirects to library after successful purchase, handles authentication checks and error states.",
  "frontend/src/pages/StorefrontPage.tsx": "Main storefront page with hero section, search/filter bar, and product grid; shows profile setup modal for authenticated users without profiles.",
  "frontend/src/utils/adminErrors.ts": "Utility function that translates backend error messages into user-friendly text for admin UI, handling authorization, file upload, network, and product-related errors.",
  "frontend/src/utils/buildVersion.ts": "Manages build version tracking and cache-busting by detecting version mismatches between stored and current versions, triggering a one-time page reload when needed to prevent stale UI issues.",
  "frontend/src/utils/deploymentCommands.ts": "Provides helper functions that return standard dfx deployment commands for retrying deployments, upgrading canisters, and running diagnostic checks on the Internet Computer network.",
  "frontend/src/utils/deploymentFixSuggester.ts": "Analyzes parsed deployment logs and suggests specific fixes with rationale and code snippets based on common error patterns like missing dependencies, type errors, cycle shortages, and permission issues.",
  "frontend/src/utils/deploymentLogParser.ts": "Parses deployment output text to identify the failing step (build, bundle, install, or unknown) and extracts relevant error blocks using pattern matching on common error indicators.",
  "frontend/src/utils/formatDeploymentReport.ts": "Formats parsed deployment logs and fix suggestions into a structured, human-readable report with sections for failing step, suggested fix, rationale, commands, and full error output.",
  "frontend/src/utils/normalizeProfileName.ts": "Provides a simple utility function to normalize user profile names by trimming leading and trailing whitespace for consistent handling across the application.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for extracting and persisting URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for maintaining state across navigation and functions to clear sensitive parameters from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system with CSS variables, container settings, custom animations, border radius variables, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file tracking known issues with owner/admin principal recognition after initialization and pending fix requests to correct backend admin check logic and verify auto-initialization assignment."
}