{
  "backend/main.mo": "Main actor implementing a digital product storefront with categories, products, user profiles, purchases, and access control. Includes auto-initialization logic that assigns the first authenticated user as admin and creates default categories.",
  "backend/migration.mo": "Migration module that transforms old actor state (with ownerEmail and ownerPrincipal fields) to new actor state (without those fields), preserving categories, products, userProfiles, purchases, and adminSystemInitialized flag.",
  "feature_evidence.json": "Feature evidence report documenting the 'Initialize as Owner' button feature, indicating it should either correctly assign owner access or be removed if auto-assignment on first authentication works correctly.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and configuration, describing UI structure, authentication flows, admin access checks, and product management features.",
  "frontend/index.css": "Global CSS with Tailwind directives and custom CSS variables defining OKLCH color tokens for light and dark themes, including background, foreground, primary, secondary, muted, accent, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, page title 'Engineer Notes Shop', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for storefront, product detail, admin dashboard, buyer library, category browsing, about, and contact pages, wrapped in ThemeProvider and Toaster.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-page access denied component displaying shield icon, customizable message (defaulting to explanation of automatic owner assignment), return-to-storefront button, and optional custom action ReactNode.",
  "frontend/src/components/admin/AdminDiagnostics.tsx": "Displays diagnostic information about authentication status, admin privileges, admin system initialization, and product loading states with status badges and icons.",
  "frontend/src/components/admin/AdminUploadsTroubleshootingHint.tsx": "Shows contextual alerts and troubleshooting guidance for admin upload functionality based on authentication, admin status, and system initialization state with retry buttons.",
  "frontend/src/components/admin/ProductFileUploadButton.tsx": "A file upload button component that accepts PDF files, validates file type, and triggers callbacks for file selection with loading and disabled states.",
  "frontend/src/components/admin/SafeProductUploadAction.tsx": "Error boundary component that wraps ProductFileUploadButton to catch and display rendering errors with a destructive alert UI.",
  "frontend/src/components/BrandHeader.tsx": "Header component with desktop navigation and mobile Sheet menu that checks admin status via useIsCallerAdmin hook and conditionally renders admin button with loading, error, unauthorized, and authorized states.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright, developer tools button opening RequestUpdateModal, caffeine.ai attribution with UTM tracking, and build version with troubleshooting guidance for forcing specific versions via URL parameter.",
  "frontend/src/components/Layout.tsx": "Root layout wrapper component that renders BrandHeader, main content area with children, and Footer in a flex column structure ensuring footer stays at bottom.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity authentication, displaying different states (logging in, authenticated, unauthenticated) with icons and supporting both default and mobile variants.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with title, author, price, type badge (book/notes), and a link to view product details.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts new users to enter their name for profile setup, with validation and submission handling.",
  "frontend/src/components/RequestUpdateModal.tsx": "A multi-tab modal providing developer tools for requesting updates, retrying deployments, and analyzing deployment failures with command generation and clipboard copy functionality.",
  "frontend/src/components/SearchAndFilterBar.tsx": "A search input component with an icon that allows users to filter products by title or author.",
  "frontend/src/components/StorefrontHero.tsx": "A hero section component displaying a headline, description, and hero image for the engineering knowledge storefront.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor with authentication, initializing access control with admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including admin initialization, access control, user profiles, categories, and product management with mutations and cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light/dark themes, typography styles, and utility classes for page layout and card interactions.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AboutPage.tsx": "Static about page displaying Engineer Notes mission, collection, community, and quality assurance information in a card-based layout.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard for managing products with CRUD operations, file uploads, publish/unpublish toggles, store initialization, and access control checks with error handling and diagnostics.",
  "frontend/src/pages/BuyerLibraryPage.tsx": "Displays a buyer's purchased products with download functionality, including authentication checks, loading states, and error handling for file downloads.",
  "frontend/src/pages/CategoryStorefrontPage.tsx": "Shows products filtered by category with search functionality, displaying category details and handling profile setup for authenticated users.",
  "frontend/src/pages/ContactPage.tsx": "Static contact page displaying various contact methods (general inquiries, technical support, content suggestions, business inquiries) with email addresses and descriptions.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays detailed product information with purchase functionality, including price, author, description, and navigation back to storefront.",
  "frontend/src/pages/StorefrontPage.tsx": "Main storefront page showing all available products with hero section, search/filter bar, and profile setup modal for new authenticated users.",
  "frontend/src/utils/adminErrors.ts": "Utility function that translates backend error messages into user-friendly text for admin UI, handling authorization, file upload, product, and network errors.",
  "frontend/src/utils/buildVersion.ts": "Manages build version tracking and cache-busting by detecting version mismatches between stored and current versions, triggering a one-time hard reload when needed to prevent stale UI issues.",
  "frontend/src/utils/deploymentCommands.ts": "Provides helper functions that return standard dfx deployment commands for IC projects, including retry, upgrade, and diagnostic commands.",
  "frontend/src/utils/deploymentFixSuggester.ts": "Analyzes parsed deployment logs and suggests fixes with rationale and code snippets based on common error patterns like missing dependencies, type errors, cycle issues, and permission problems.",
  "frontend/src/utils/deploymentLogParser.ts": "Parses deployment output text to identify the failing step (build, bundle, install, or unknown) and extracts relevant error blocks using pattern matching.",
  "frontend/src/utils/formatDeploymentReport.ts": "Formats a structured deployment failure report for developers, combining parsed log data and fix suggestions into a readable text output with sections for failing step, suggested fix, commands, and error details.",
  "frontend/src/utils/normalizeProfileName.ts": "Provides a simple utility function to normalize user profile names by trimming whitespace for consistent handling across the application.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme extensions including OKLCH color system, container settings, typography, animations, and plugins for the frontend styling.",
  "project_state.json": "Project state tracking document indicating an event ticketing system with critical owner/admin access authentication issues for Google-authenticated user, with pending fix requests to resolve backend owner assignment logic."
}