{
  "backend/main.mo": "Main canister actor managing categories, products, user profiles, purchases, and admin initialization/ownership claim logic with access control and storage mixins.",
  "backend/migration.mo": "Migration module defining data types and returning the previous actor state unchanged during upgrades.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files and components.",
  "frontend/index.css": "Tailwind base styles and OKLCH color tokens for light and dark themes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up the TanStack Router, page routes, and global providers like ThemeProvider and Toaster.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI component displaying an access denied message with optional custom text and a button to return home.",
  "frontend/src/components/admin/AdminDiagnostics.tsx": "Displays diagnostic status for auth, admin privileges, product fetch, and admin system initialization.",
  "frontend/src/components/admin/AdminUploadsTroubleshootingHint.tsx": "Provides contextual alerts explaining why admin product uploads may be unavailable and shows retry options.",
  "frontend/src/components/admin/ProductFileUploadButton.tsx": "Button that triggers PDF file selection and passes the chosen file to a callback with loading support.",
  "frontend/src/components/admin/SafeProductUploadAction.tsx": "Error boundary wrapper around ProductFileUploadButton to show a safe fallback alert if it fails.",
  "frontend/src/components/BrandHeader.tsx": "Header with navigation, authentication controls, categories list, and admin-access-aware UI.",
  "frontend/src/components/Footer.tsx": "Footer with copyright, developer tools modal trigger, and caffeine.ai attribution.",
  "frontend/src/components/Layout.tsx": "Root layout wrapping pages with a header, footer, and main content area.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button handling auth via Internet Identity with loading states and mobile variant support.",
  "frontend/src/components/ProductCard.tsx": "Displays product info with category icon, price, author, and link to product details.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting user to enter and save their name during profile setup.",
  "frontend/src/components/RequestUpdateModal.tsx": "Developer tool modal for update requests, retry commands, and generating deployment failure reports.",
  "frontend/src/components/SearchAndFilterBar.tsx": "Search bar component for filtering products by title or author.",
  "frontend/src/components/StorefrontHero.tsx": "Hero section with marketing text and image for the storefront landing page.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries when it updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend calls with React Query hooks for user profiles, admin checks, products, categories, and store state.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes with utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders a static informational About page describing the platform’s mission, collection, and values.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Implements the admin dashboard, handling product management, uploads, admin initialization, and access control.",
  "frontend/src/pages/BuyerLibraryPage.tsx": "Displays the user's purchased products and allows downloading files with authentication checks and error handling.",
  "frontend/src/pages/CategoryStorefrontPage.tsx": "Shows products within a specific category with search filtering, loading states, and profile setup prompts.",
  "frontend/src/pages/ContactPage.tsx": "Provides contact information and support categories with descriptive cards and guidance alerts.",
  "frontend/src/pages/ProductDetailPage.tsx": "Loads and displays product details, handles purchasing, and shows loading/error states.",
  "frontend/src/pages/StorefrontPage.tsx": "Lists all storefront products with search filtering, loading states, error handling, and optional profile setup.",
  "frontend/src/utils/deploymentCommands.ts": "Provides helper functions returning recommended deployment retry and diagnostic commands.",
  "frontend/src/utils/deploymentFixSuggester.ts": "Analyzes parsed deployment logs and returns fix suggestions based on common error patterns.",
  "frontend/src/utils/deploymentLogParser.ts": "Parses raw deployment logs to determine the failing step and extract relevant error text using pattern matching.",
  "frontend/src/utils/formatDeploymentReport.ts": "Formats a structured deployment failure report combining parsed log details and suggested fixes into a readable text output.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, storing/retrieving them in sessionStorage, and managing hash‑based routing values.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, typography, animations, and plugin integrations for the frontend UI.",
  "project_state.json": "Holds project metadata, known issues, and architectural notes describing current app behavior and outstanding deployment/UI problems."
}