{
  "backend/main.mo": "Canister implementing product CRUD, authorization checks, file uploads, and purchase tracking using maps and mixin storage/authorization modules.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, tests, and confidence metadata for deployment retry and error-surfacing features.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend files covering layout, components, pages, hooks, and deployment utilities.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color tokens, light/dark theme variables, and global element styling.",
  "frontend/index.html": "Base HTML entry file mounting the React app and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for storefront, product pages, admin dashboard, and library, wrapped with theme and toast providers.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Access denied UI showing an error message and navigation button back to the storefront.",
  "frontend/src/components/BrandHeader.tsx": "Header with logo, navigation links, role-aware buttons, and user greeting based on profile and admin status.",
  "frontend/src/components/Footer.tsx": "Footer displaying copyright, a developer tools modal trigger, and a caffeine.ai attribution link.",
  "frontend/src/components/Layout.tsx": "Page wrapper combining header, main content, and footer into a consistent app layout.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button integrated with Internet Identity, handling states, errors, and query cache resets.",
  "frontend/src/components/ProductCard.tsx": "Product preview card showing metadata, price, publish status badge, and link to the product detail page.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal that collects a user's name and saves their profile using a mutation hook.",
  "frontend/src/components/RequestUpdateModal.tsx": "Developer tools modal enabling update requests, retry command copying, and deployment failure report generation.",
  "frontend/src/components/SearchAndFilterBar.tsx": "Search bar component that updates a query string based on user input.",
  "frontend/src/components/StorefrontHero.tsx": "Hero section for the storefront with a title, description, and featured image.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, roles, products, and storefront data.",
  "frontend/src/index.css": "Tailwind CSS base styles with light/dark theme variables and shared layout utilities.",
  "frontend/src/main.tsx": "App entry point that mounts React, configures React Query, and wraps the app with the Internet Identity provider.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin interface for managing products, including creation, editing, publishing, deleting, and file uploads with progress tracking.",
  "frontend/src/pages/BuyerLibraryPage.tsx": "Displays a user's purchased products and handles secure file downloads with error handling and loading states.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows detailed product info, handles purchasing, and redirects users to their library after a successful purchase.",
  "frontend/src/pages/StorefrontPage.tsx": "Public storefront listing products with search filtering, loading states, and optional profile setup prompts.",
  "frontend/src/utils/deploymentCommands.ts": "Provides recommended deployment retry and diagnostic command lists for IC deployments.",
  "frontend/src/utils/deploymentFixSuggester.ts": "Generates suggested fixes for deployment failures by analyzing parsed error patterns from build, bundle, or install steps.",
  "frontend/src/utils/deploymentLogParser.ts": "Parses raw deployment logs to detect failing steps and extract relevant error text blocks.",
  "frontend/src/utils/formatDeploymentReport.ts": "Formats parsed deployment errors and fix suggestions into a readable multi-section failure report.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params (including hash routing), persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, container settings, and plugin integrations.",
  "project_state.json": "Stores the project’s state, feature list, known issues, and metadata for build and planning."
}