{
  "kind": "build_request",
  "title": "Fix admin authentication to allow access to admin dashboard",
  "projectName": "Engineer Notes Shop",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix admin authentication so that users who see the Admin menu option can successfully access the admin dashboard. The Admin option is visible in the menu (as shown in screenshots of the live version) but clicking it does not grant access to admin features.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user-final"
        ],
        "quotes": [
          "Yes, admin option was observed but not authenticated, this is the screen shot of live tab"
        ]
      },
      "acceptanceCriteria": [
        "User with admin privileges can click the Admin menu option and successfully access the admin dashboard",
        "Admin dashboard displays product management interface with CRUD operations",
        "No authentication errors or access denied messages when admin user navigates to admin pages"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Verify and fix the backend admin principal registration system. The current authenticated user's Internet Identity principal must be correctly registered as an admin in the backend so that the isAdmin check returns true.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-final"
        ]
      },
      "acceptanceCriteria": [
        "Backend correctly stores and recognizes the first authenticated user as admin (auto-initialization)",
        "isAdmin() backend query returns true for the registered admin principal",
        "Admin access checks work consistently across all admin-protected endpoints"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Fix the frontend admin access verification in useQueries hooks to properly handle the backend isAdmin response. Ensure the admin check query correctly reflects the user's admin status and updates the UI accordingly.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-final"
        ]
      },
      "acceptanceCriteria": [
        "useIsAdmin hook correctly fetches and returns admin status from backend",
        "Admin-protected routes properly redirect or show access denied when isAdmin is false",
        "Admin UI components conditionally render based on actual admin status"
      ]
    }
  ],
  "constraints": [
    "Must maintain single-actor backend architecture",
    "Must preserve Internet Identity authentication flow",
    "Must not modify frontend/src/hooks/useInternetIdentity.ts",
    "Must not modify frontend/src/hooks/useActor.ts"
  ],
  "nonGoals": [
    "Changing the UI design or layout of admin pages",
    "Adding new admin features beyond fixing authentication",
    "Modifying category or product management functionality",
    "Changing the menu structure or navigation"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}