{
  "kind": "build_request",
  "title": "Fix missing Upload PDF button visibility on Admin Dashboard",
  "projectName": "Engineer Notes Shop",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-28",
      "text": "Make it impossible for the Admin Dashboard to reach a state where the user is an admin with a successfully loaded admin product list but the per-product \"Upload PDF\" control is not visible. If the Upload PDF control cannot be rendered for any reason, render an explicit, user-visible inline error in its place on that product card explaining why.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Still Product upload button is not visible"
        ]
      },
      "acceptanceCriteria": [
        "When viewing /admin as an admin and the product grid is rendered, every product card shows a visible \"Upload PDF\" button (or a visible inline error message in the same location if it truly cannot render).",
        "The Upload PDF control is not hidden by responsive CSS (e.g., not gated behind `hidden` breakpoints) and remains visible on mobile and desktop layouts.",
        "The Upload PDF button is only disabled during an active upload for that specific product; otherwise it is enabled and clickable."
      ]
    },
    {
      "id": "REQ-29",
      "text": "Add an always-visible \"Admin Diagnostics\" section at the top of the Admin Dashboard that helps explain why the Upload PDF button might not be visible, including: authentication status, caller principal (as text), admin check status/result, admin products query status/result count, and any error messages from those queries.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Still Product upload button is not visible"
        ]
      },
      "acceptanceCriteria": [
        "When not signed in, the page clearly states sign-in is required (existing behavior is OK) and also shows that admin diagnostics are unavailable without authentication.",
        "When signed in but not admin, the UI clearly states \"Not authorized as store owner\" and the diagnostics show the admin check result as false.",
        "When admin check or admin products query fails, diagnostics show the captured error message string in English.",
        "When admin products load successfully, diagnostics show a non-zero or zero product count accurately."
      ]
    },
    {
      "id": "REQ-30",
      "text": "Ensure the backend admin determination is correctly configured so the store owner can be recognized as admin in production (so the Admin Dashboard and upload functionality can be used). If the canister controller/installer is intended to be admin by default, ensure `isCallerAdmin()` returns true for that principal and admin-restricted methods (create/update/delete/publish/upload/getProducts) succeed for that principal.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Still Product upload button is not visible"
        ]
      },
      "acceptanceCriteria": [
        "When the store owner signs in with Internet Identity and navigates to /admin, the admin check succeeds (returns true) and the admin product list loads without trapping.",
        "As the store owner, uploading a PDF via `uploadProductFile` succeeds (no authorization trap).",
        "As a non-admin user, admin-only calls still correctly trap with an authorization error (no regression in access control)."
      ]
    },
    {
      "id": "REQ-31",
      "text": "Add stable test selectors to the Upload PDF control and its container so it can be reliably verified in future builds (e.g., data-testid on the per-product upload button and on the per-product action area).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Still Product upload button is not visible"
        ]
      },
      "acceptanceCriteria": [
        "Each product card renders a unique, deterministic test id for its upload action (e.g., includes the product id).",
        "If the upload control is replaced by an inline error message (REQ-28), that message also has a deterministic test id for the same product id."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn components); compose them instead.",
    "Do not modify immutable frontend paths listed in SYSTEM_CONTEXT.",
    "Backend must remain a single Motoko actor with all logic in backend/main.mo; only introduce backend/migration.mo if a state migration is truly required."
  ],
  "nonGoals": [
    "Adding new product fields or changing the product schema beyond what is required to fix admin detection and upload-button visibility.",
    "Introducing any new authentication provider beyond Internet Identity.",
    "Adding real-time progress via websockets or external services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}