{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix product visibility in category section and storefront",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Update the admin dashboard to display product price and show validation warnings if price is missing or invalid before publishing",
      "acceptanceCriteria": [
        "Admin dashboard displays the current price for each product",
        "Warning badge appears on products without valid prices",
        "Publish button is disabled or shows warning for products without prices"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Add price display column to the products table showing formatted price in dollars. Add visual warning badge (amber/yellow) next to products where priceInCents is 0 or missing. Update the publish toggle UI to show a disabled state or warning tooltip when attempting to publish products without valid prices. Include helpful text like 'Set price before publishing' when hovering over disabled publish controls for products with invalid prices."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add admin UI functionality to edit product price and purchase options before publishing",
      "acceptanceCriteria": [
        "Admin can set or update product price through the dashboard",
        "Price input validates numeric values and prevents invalid entries",
        "Changes to price are immediately reflected in the product data"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Add inline price editing capability to each product row. Include a number input field (or edit button that opens an input) for priceInCents, converting between cents (backend) and dollars (user-facing display). Validate that input is numeric, non-negative, and properly converts decimal dollars to integer cents. Wire up the existing updateProduct mutation from useQueries.ts to save price changes, ensuring the mutation invalidates the products query cache so the UI updates immediately after save."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Verify that the updateProduct mutation properly handles priceInCents parameter and invalidates all relevant query keys (admin products list, storefront products, category products) after successful update to ensure UI consistency across all views."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Investigate and fix the specific case where the one uploaded product is not appearing in category listings despite being visible in admin dashboard",
      "acceptanceCriteria": [
        "The specific uploaded product appears in its assigned category on both draft and live pages",
        "Product data consistency is verified between admin view and public storefront",
        "Query cache invalidation works correctly after product updates"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CategoryStorefrontPage.tsx",
          "operation": "modify",
          "description": "Add debug diagnostics panel (similar to existing one) that displays the raw query response from listStorefrontProductsByCategory, showing product count, isPublished status, priceInCents values, and category assignments. Include a manual refresh button that invalidates the category products query cache. Add console logging of the category parameter and returned products array to help diagnose filtering issues. Ensure the query is properly enabled and not being skipped due to authentication state checks."
        },
        {
          "path": "frontend/src/pages/StorefrontPage.tsx",
          "operation": "modify",
          "description": "Add similar debug diagnostics for the main storefront products list (listStorefrontProducts query). Display product count, publication status distribution, and any filtering being applied. Include console logging to verify products are being returned from the backend. Add a refresh button that invalidates the storefront products cache to test if stale cache is causing visibility issues."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review all product-related query cache invalidation logic. Ensure that when setProductPublished, updateProduct, or uploadProductFile mutations succeed, they invalidate all relevant query keys: ['products'], ['allProducts'], ['storefrontProducts'], ['categoryProducts'], and any category-specific keys. Add explicit invalidation for both admin and storefront views. Consider adding refetchOnMount or refetchOnWindowFocus options to category and storefront product queries to reduce stale cache issues."
        }
      ]
    }
  ]
}