{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix owner access auto-assignment - Frontend updates",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Update 'Initialize as Owner' button behavior or remove it if auto-assignment is working",
      "acceptanceCriteria": [
        "Either the button successfully grants owner access when clicked and shows a success confirmation",
        "Or the button is removed from the Access Denied screen if auto-assignment on login is working",
        "The user experience is clear and does not present non-functional UI elements"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AccessDeniedScreen.tsx",
          "operation": "modify",
          "description": "Review and potentially remove the 'Initialize as Owner' button and its associated logic. If the backend auto-assignment (REQ-1, REQ-2) is working correctly, this button becomes unnecessary. If the button is retained, ensure it correctly calls the backend initialization method and provides user feedback (success/error toast messages). Add error handling for failed initialization attempts."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review the admin initialization mutation hook. If the 'Initialize as Owner' button is retained, ensure the mutation properly invalidates admin status queries after successful initialization so the UI updates immediately. If the button is removed, this mutation may no longer be needed on the frontend."
        },
        {
          "path": "frontend/src/components/admin/AdminDiagnostics.tsx",
          "operation": "modify",
          "description": "Ensure the Admin Diagnostics panel correctly reflects the updated admin status after the backend changes (REQ-1, REQ-2). The component should automatically refresh when the user's admin status changes, showing 'Admin Check: ✓ Admin' with a green indicator instead of the red '✗ Not admin' status."
        },
        {
          "path": "frontend/src/pages/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Review the admin dashboard access control logic to ensure it correctly reflects the user's admin status based on the backend isCallerAdmin() response. Remove or update any hardcoded checks that might be preventing the authenticated principal from accessing admin features. Ensure the page refreshes admin status when needed."
        }
      ]
    }
  ]
}