{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Admin Authentication - Backend Owner Recognition Issue",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Remove the 'Initialize as Owner' button from AccessDeniedScreen since auto-initialization should handle owner assignment automatically",
      "acceptanceCriteria": [
        "If auto-initialization works correctly, remove the 'Initialize as Owner' button from the AccessDeniedScreen",
        "If the button is kept, ensure it properly triggers the backend initialization and updates the UI state immediately",
        "The user experience is clear and doesn't show conflicting states (Initialized ✓ but Not admin ✗)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AccessDeniedScreen.tsx",
          "operation": "modify",
          "description": "Remove the 'Initialize as Owner' button and its associated customAction prop since the authorization component handles automatic owner assignment on first authenticated access. Update the default message to clearly state that admin access is automatically granted to the first authenticated user without requiring manual initialization. This eliminates the confusing UI state where initialization appears successful but admin check fails."
        },
        {
          "path": "frontend/src/pages/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Remove the logic that passes the 'Initialize as Owner' button as customAction to AccessDeniedScreen. Simplify the access denied handling to show only the default AccessDeniedScreen without custom actions, relying on the automatic initialization provided by the authorization component's useActor hook integration."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review and potentially remove the useInitializeStore mutation hook if it's only used for manual initialization via the removed button. Verify that no other parts of the application depend on this mutation. If it's still needed for other initialization scenarios, keep it but ensure it properly invalidates the admin check queries after successful execution."
        },
        {
          "path": "frontend/src/components/admin/AdminDiagnostics.tsx",
          "operation": "modify",
          "description": "Update the diagnostics display to better reflect the automatic initialization flow from the authorization component. Add explanatory text that clarifies the expected behavior: authenticated users should automatically become admin on first access. Consider adding a 'Refresh Admin Status' button that re-queries isCallerAdmin and isAdminSystemInitialized to help diagnose state issues without requiring full page refresh."
        },
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Review the automatic admin initialization logic that should be triggered when creating the actor with authentication. Ensure that the initialization is properly awaited and that dependent queries (admin status, system initialized) are invalidated after the initialization completes. Verify the component's usage instructions are being followed correctly: the first authenticated user should automatically receive admin role without requiring manual initialization calls."
        }
      ]
    }
  ]
}